package com.inkenkun.x1.zunda

object Main extends App {

  val test =
    """
      |#EVENT0 4       wr:筆者 非未来  0       叙述    成立    0       0
      |#EVENT1 13      wr:筆者 未来    0       叙述    不成立  0       0
      |#EVENT2 17      wr:筆者 未来    0       意志    高確率  ポジティブ      0
      |#EVENT3 20      wr:筆者 非未来  0       叙述    成立    0       0
      |* 0 2D 0/1 1.688174
      |次郎    名詞,固有名詞,人名,名,*,*,次郎,ジロウ,ジロー
      |は      助詞,係助詞,*,*,*,*,は,ハ,ワ
      |* 1 2D 0/1 3.492852
      |大阪    名詞,固有名詞,地域,一般,*,*,大阪,オオサカ,オーサカ
      |に      助詞,格助詞,一般,*,*,*,に,ニ,ニ
      |* 2 7D 0/2 -1.650377
      |行っ    動詞,自立,*,*,五段・カ行促音便,連用タ接続,行く,イッ,イッ
      |た      助動詞,*,*,*,特殊・タ,基本形,た,タ,タ
      |が      助詞,接続助詞,*,*,*,*,が,ガ,ガ
      |、      記号,読点,*,*,*,*,、,、,、
      |* 3 7D 0/1 -1.650377
      |太郎    名詞,固有名詞,人名,名,*,*,太郎,タロウ,タロー
      |は      助詞,係助詞,*,*,*,*,は,ハ,ワ
      |* 4 5D 0/2 0.320510
      |東京    名詞,固有名詞,地域,一般,*,*,東京,トウキョウ,トーキョー
      |に      助詞,格助詞,一般,*,*,*,に,ニ,ニ
      |は      助詞,係助詞,*,*,*,*,は,ハ,ワ
      |* 5 7D 0/1 -1.650377
      |行か    動詞,自立,*,*,五段・カ行促音便,未然形,行く,イカ,イカ
      |ず      助動詞,*,*,*,特殊・ヌ,連用ニ接続,ぬ,ズ,ズ
      |* 6 7D 0/1 -1.650377
      |地元    名詞,一般,*,*,*,*,地元,ジモト,ジモト
      |に      助詞,格助詞,一般,*,*,*,に,ニ,ニ
      |* 7 -1D 3/4 0.000000
      |残ろ    動詞,自立,*,*,五段・ラ行,未然ウ接続,残る,ノコロ,ノコロ
      |う      助動詞,*,*,*,不変化型,基本形,う,ウ,ウ
      |と      助詞,格助詞,引用,*,*,*,と,ト,ト
      |し      動詞,自立,*,*,サ変・スル,連用形,する,シ,シ
      |た      助動詞,*,*,*,特殊・タ,基本形,た,タ,タ
      |""".stripMargin

  val keyword = "#EVENT"
  val lines = test.split( '\n' )
  val events = lines.filter( _.startsWith( keyword ) ).map { l =>
    val ev = l.replace( keyword, "" ).split( """[\s]+""" )
    Modality( ev(1).toInt, ev(2), ev(3), ev(4), ev(5), ev(6), ev(7) )
  }

  events.foreach { l =>
    println( "-------------------------" )
    println( l.pos )
    println( l.truth )
  }

}
